{"class_name": "Sequential", "config": {"name": "Testmodel_2D", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 8], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_6"}}, {"class_name": "Dense", "config": {"name": "Final_Paths", "trainable": true, "dtype": "float32", "units": 40, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Reshape", "config": {"name": "Shape_to_paths", "trainable": true, "dtype": "float32", "target_shape": [10, 4]}}, {"class_name": "PathNormalisation_layer", "config": {"name": "Normalise_paths", "trainable": true, "dtype": "float32"}}, {"class_name": "Covariance_layer", "config": {"name": "Cov", "trainable": true, "dtype": "float32"}}]}, "keras_version": "2.4.0", "backend": "tensorflow"}